{"id":1640,"date":"2017-12-19T13:26:56","date_gmt":"2017-12-19T13:26:56","guid":{"rendered":"http:\/\/stellarium.omnicom-dev.com\/main-demo\/?p=1640"},"modified":"2019-02-04T13:12:25","modified_gmt":"2019-02-04T13:12:25","slug":"neptune-lost-in-la-la-land","status":"publish","type":"post","link":"http:\/\/stellarium.bold-themes.com\/light\/2017\/12\/19\/neptune-lost-in-la-la-land\/","title":{"rendered":"Neptune: Lost in La La Land"},"content":{"rendered":"<div class=\"bt_bb_wrapper\"><p>The ruler of dreamy, sensitive Pisces, Neptune has the second strongest gravity in the solar system after Jupiter. No wonder Piscean people have such a magnetic pull! With its perpetual storms and active climate, Neptune is known for whipping up drama and confusion. It can have a disorienting effect, making it hard to stay in touch with what’s “real.” Neptune personalities are not exactly known for their stellar logical. But compassion? Absolutely! People with a strongly placed Neptune in their chart make great therapists, shamans and healers.<\/p>\n<p>Because of its distance from the Sun, Neptune has a huge orbit to make—it takes 165 years to circle el Sol. Thus, Neptune will linger in a single sign for an average of fifteen years, shaping generations. Divinely inspired creativity comes from Neptune (with some help from Venus). Here is where we tap into the right brain, releasing logic and letting pure creative impulse flow through us.<\/p>\n<p>Looking at the music of a generation can also be a fun way to track this celestial influence. From 1998-2012 Neptune toured Aquarius, the sign that governs electricity. During this phase, we saw a rise in EDM (Electronic Dance Music) and deejay culture. Early music sharing websites like Napster were also born while sites like MySpace gave independent artists a forum to share their tracks without requiring a record deal.<\/p>\n<p>Neptune’s placement in your birth chart can even show a propensity toward addiction. How we relate to mind-altering substances is determined by Neptune. Neptune can dissolve the ego—but this loss of “self” can also provoke a crisis. Hospitals and institutions fall under Neptune’s watch—little surprise since following Neptune’s compass without paying heed to other planets like sensible Saturn or the self-focused Sun might just get one strapped to the gurney. Like the other outer planets, Neptune goes retrograde annually, for about five months. These periods can be deeply introspective times—but ones that require extra reality checks!<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>The ruler of dreamy, sensitive Pisces, Neptune has the second strongest gravity in the solar system after Jupiter. No wonder Piscean people have such a magnetic pull! With its perpetual storms and active climate, Neptune is known for whipping up drama and confusion.<\/p>\n","protected":false},"author":2,"featured_media":1648,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[17],"tags":[],"_links":{"self":[{"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/posts\/1640"}],"collection":[{"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/comments?post=1640"}],"version-history":[{"count":2,"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/posts\/1640\/revisions"}],"predecessor-version":[{"id":3479,"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/posts\/1640\/revisions\/3479"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/media\/1648"}],"wp:attachment":[{"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/media?parent=1640"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/categories?post=1640"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/stellarium.bold-themes.com\/light\/wp-json\/wp\/v2\/tags?post=1640"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}